#include <iostream>
#include <windows.h>
#include "university.h"

using namespace std;

int main() {
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);

    int globalYear = 2026;

    cout << ">>> ЕТАП 1: 3 способи створення об'єктів за допомогою конструкторів\n";
    cout << "------------------------------------------------------------\n";
    Student s1; 
    
    Student s2 = Student("Блаута Віка", 101, 55501, globalYear);
    Student s3("Петренко Петро", 102, 55502, globalYear);
    cout << "\n";


    cout << ">>> ЕТАП 2: Статичні елементи класу\n";
    cout << "------------------------------------------------------------\n";
    Student::printTotalStudents();
    cout << "\n";


    cout << ">>> ЕТАП 3: Зовнішні функції та конструктор копіювання\n";
    cout << "------------------------------------------------------------\n";
    calculateBonus(s2);
    
    calculateBonus(&s3);
    cout << "\n";


    cout << ">>> ЕТАП 4: Динамічна пам'ять та вказівники на об'єкт\n";
    cout << "------------------------------------------------------------\n";
    Student* dynStudent = new Student("Стус Василь", 103, 55503, globalYear);
    
    delete dynStudent; 
    cout << "\n";


    cout << ">>> ЕТАП 5: Сценарії взаємодії об'єктів (Агрегація, Композиція, Асоціація)\n";
    cout << "------------------------------------------------------------\n";
    Teacher t1("Шевченко О.В.");
    Course c1("Програмування С++", 5);
    c1.assignTeacher(&t1); 

    cout << "\t[*] (Композиція) Залікова книжка створюється і жорстко зберігається всередині класу Student.\n";

    Exam::conductExam(s2, c1, t1, 95);
    cout << "\n";

    cout << "============================================================\n";
    cout << "   ЗАВЕРШЕННЯ ПРОГРАМИ (Спрацювання деструкторів для блоку) \n";
    return 0; 
}